app/Http/Livewire/Assignment/Create.php

select * from `users`
select * from `assignment_status`
select * from `projects`
---
    public function render()
    {
        $auth = Auth::user();

        if ($auth->id == 1) {
            $data["users"] = User::all();
            $data["assignment_status"] = AssignmentStatus::all();
        } else {
            $data["users"] = User::where("user_id", $auth->user_id)->get();
        }
        $data["projects"] = Project::all();