app/Http/Livewire/Assignment/Detail.php

    public function mount($assign_id)
    {
        $this->assignment = Assignment::where("assign_id", $assign_id)->first();
---
select * from `assignments` where `assignments`.`assign_id` = '22f3fd78-e7ac-4838-9708-4c2c3d35c7be' limit 1