app/Http/Livewire/Assignment/Index.php

select * from `assignments` where `user_id` = '723baffd-ca8c-42b9-8d7a-349709270e3f' and `show_date` <= '2022-01-28' and `assign_status_id` = 1 limit 10 offset 0
select * from `projects` where `projects`.`project_id` in ('5e08503a-a57d-4c67-bb42-350da8cda273')
select count(*) as aggregate from `assignments` where `user_id` = '723baffd-ca8c-42b9-8d7a-349709270e3f' and `show_date` <= '2022-01-28' and `assign_status_id` = 1
---
    public function render()
    {
        $data = [
            "assignments" => Assignment::with("project")->where("user_id", Auth::user()->user_id)->where("show_date", "<=", date("Y-m-d"))->where("assign_status_id", 1)->paginate($this->show_count)
        ];