app/Http/Controllers/AssignmentController.php

select count(*) as aggregate from `assignments` where `user_id` = 'e490a824-25e2-4808-be49-764ce0b99a40' and `show_date` <= '2022-02-16' and `assign_status_id` = 1
---
    public function index()
    {
        $data = [
            "assignments" => Assignment::where("user_id", Auth::user()->user_id)->where("show_date", "<=", date("Y-m-d"))->where("assign_status_id", 1)->paginate(20),
        ];

select * from `users`
select * from `assignment_status`
select * from `projects`
---
    public function create()
    {
        $auth = Auth::user();
        // dd($auth);

        if ($auth->id == 1) {
            $data["users"] = User::all();
            $data["assignment_status"] = AssignmentStatus::all();
        } else {
            $data["users"] = User::where("user_id", $auth->user_id)->get();
        }
        $data["projects"] = Project::all();