app/Http/Controllers/HomeController.php

select count(*) as aggregate from `assignments` where `user_id` = 'e490a824-25e2-4808-be49-764ce0b99a40' and `show_date` <= '2022-02-16' and `assign_status_id` = 1
---
    public function index()
    {
        $data = [
            "total_assignment" => Assignment::where("user_id", Auth::user()->user_id)->where("show_date", "<=", date("Y-m-d"))->where("assign_status_id", 1)->count(),
        ];